{
    "menuData": [
        "Выбор мини-игры",
        "Достижения",
        "Настройки",
        "Об игре",
        "Выход",
        "Применить изменения",
        "Язык",
        "Графика",
        "Аудио",
        "Текущий язык",
        "Межбуквенный интервал",
        "Межстроковый интервал",
        "Интервал между словами",
        "Стиль шрифта",
        "Низкое",
        "Среднее",
        "Высокое",
        "Разрешение",
        "Частота кадров",
        "Вертикальная синхронизация",
        "Режим отображения",
        "Качество",
        "Полный экран",
        "Безрамочный",
        "Оконный",
        "Общая громкость",
        "Музыка",
        "Звуки",
        "Внимание",
        "Вы уверены, что хотите выйти из игры?",
        "В меню",
        "Вы уверены, что хотите выйти в меню?",
        "Информация",
        "К данной мини-игре нет дополнительной информации :(",
        "Разработчик",
        "Игра сделана специально для"
    ],
    "gameData": [
        "Калибровка зоны",
        "Выбор предмета",
        "Выбор зоны сканирования",
        "Ввод параметров поля",
        "Установка калибровочного поля",
        "Переворот камер",
        "Настройка вертикальных линий",
        "Регулировка фокуса",
        "Передвижение камер",
        "Регулировка сканера",
        "Регулировка диафрагмы камер",
        "Сканирование",
        "Подготовка предмета",
        "Полное сканирование",
        "Построение модели",
        "Обработка",
        "Очистка шума",
        "Заполнение отверстий",
        "Сшитие сканов",
        "Лампа\nБольшая",
        "Шестерня (матовая)\nСредний размер",
        "Очки (черные)\nМаленькие",
        "Большинство стационарных сканеров не позволяют отсканировать слишком крупные объекты. В среднем максимальный размер варьируется от 1 (RangeVision Pro 2) до 3 метров (RangeVision Spectrum). Для оцифровки крупных предметов рекомендуется использовать ручные сканеры, например RangeVision Helix.",
        "Прежде, чем сканировать данный объект, необходимо его подготовить, чтобы получить оптимальный результат. Это связано с камерами, позволяющими оцифровывать объекты. Работа всех оптических приборов основана на законах геометрической оптики, к которым относят: закон прямолинейного распространения света, независимости световых пучков, отражения и преломления.",
        "Как можно заметить, очки окрашены в черный цвет, который поглащает все цвета, а также установлены линзы, пропускающие часть света. Даже один из этих факторов может сильно исказить итоговый результат сканирования.",
        "Для достижения наилучшего результата рекомендуется окрасить объект полностью в матовый белый цвет. Этот процесс будет рассмотрен в следующих главах.",
        "Идеальный выбор на данный момент. Шестерню, окрашенную в матовый серый цвет, можно будет отсканировать в средней зоне без дополнительной обработки.",
        "Перед началом работы 3D сканеру требуется первичная калибровка – процесс настройки его параметров для обеспечения точности сканирования. Эта процедура позволяет минимизировать ошибки, возникающие из-за оптических и механических особенностей устройства.",
        "Вам необходимо определить объект, с которым вы продолжите дальнейшую работу по настройке сканера. Размер предмета влияет на зону сканирования. Также стоит учитывать, что стационарные сканеры не способны отсканировать слишком крупные или слишком маленькие объекты в оптимальном качестве.",
        "Выберите зону сканирования, наиболее подходящую для объекта",
        "Вы уверены, что хотите продолжить с данной зоной?",
        "При выборе данной зоны результаты сканирования не будут оптимальными. Для достижения наилучшего результата выберите зону, соответствующую размерам объекта.",
        "Определите зону сканирования для выбранного объекта. В дальнейшем это повлияет на размер области, попадающей в кадр, уровень детализации и количество сканов. При выборе большей зоны потребуется меньше сканов, но ухудшится уровень детализации.",
        "Введите параметры калибровочного поля, которые повлияют на точность сканирования и корректность последующей обработки данных. Если поле было заменено и какие-то данные не совпадают, рекомендуется пройти процесс калибровки заного.",
        "Калибровочное поле - это специальная пластина с нанесенными метками, которая используется для настройки камер и проектора сканера. Программа анализирует эти метки, определяя их положение в пространстве и корректируя возможные искажения.",
        "Plate M\n237.628 mm\nt = 23º",
        "Для выбранной зоны сканирования используйте калибровочное поле M (примерный размер 237 мм)",
        "Имя",
        "Размер",
        "Температура",
        "Материал",
        "Алюминиевый композит",
        "Материал, из которого сделано поле. Определяется автоматически.",
        "Температура, при котором измерялось поле.",
        "Размер поля.",
        "Условное название для сохранения данных о поле.",
        "Проверить",
        "Данные верны. Перейти к следующему этапу?",
        "Некорректный ввод. Пожалуйста, введите данные с обратной стороны пластины.",
        "Установите калибровочное поле перед сканером на специальной подставке и отрегулируйте наклон сканирующего модулю по нормали к полю. Выставьте рекомендуемое расстояние для выбранной зоны сканирования (50 см).",
        "Перемещение (~50 см)",
        "Наклон (нормаль к полю)",
        "Положение сканера выставлено не совсем точно. Убедитесь, что сканер находится на расстоянии около 50 см от поля и наклонен к нему по нормали (черная проекция покрывает белую область поля)",
        "Положение сканера выставлено правильно.",
        "Далее сканер устанавливается примерно под углом 90 градусов к полю, чтобы наклон сканирующего модуля влево/вправо отсутствовал. Само поле выставлено на подставке и должно приблизительно находиться на расстоянии 50 сантиметров. Нет необходимости устанавливать все очень точно, поэтому допускается небольшой разброс.",
        "Все камеры выставлены правильно!",
        "Камеры установлены не правильно. Переверните их так, чтобы треугольник на поле был направлен вверх.",
        "Убедитесь, что камеры корректно расставлены и не перевернуто ли на них изображение. В случае проблем воспользуйтесь кнопками сверху.",
        "На данном шаге настройки осуществляется проверка того, что изображения с камер не перепутаны местами и не перевернуты.",
        "На данном этапе определяется рабочее расстояние между камерой и калибровочным полем. Нет необходимости настраивать сразу две камеры, достаточно лишь одной.",
        "Меняя расстояние между камерой и полем, установите его в такое положение, когда синие линии разметки на одной из камер пересекут центральные и боковые ряды меток на поле. Изображение со второй камеры не важно. Допустимы небольшие отклонения.",
        "Влево/вправо",
        "Вперед/Назад",
        "Вертикальные линии не совпадают с боковыми и центральными рядами поля. Попробуйте передвинуть поле в другое положение.",
        "Вертикальные линии совпадают с боковыми и центральными рядами поля.",
        "На текущем шаге настраивается фокус проектора. Взаимодействуйте со сканером так, чтобы проецируемые линии были максимально резкими.",
        "Отрегулируйте фокус проектора, чтобы линии на калибровочном поле были максимально резкими.",
        "Фокус проектора настроен недостаточно четко.",
        "Фокус проектора настроен хорошо.",
        "Движение левой камеры",
        "Движение правой камеры",
        "Движение поля",
        "Перемещайте поле так, чтобы проецируемая черная линия пересекала его середину. Затем передвиньте камеры так, чтобы синяя линяя также совпадала с серединой поля.",
        "Из-за искажения перспективы синяя и черная линия могут не совпадать, но это не повлияет на настройку или сканирование.",
        "Если проецируемая черная линия не попадает на калибровочное поле, передвиньте его, не меняя расстояние между полем и сканером.\nПередвиньте камеры в положение, при котором синяя линия совпадет с проецируемой черной линией.",
        "Синяя линия не совпадает с проецируемой черной линией.",
        "Линии совпадают",
        "На данном этапе настраивается рабочее расстояние при помощи изменения вертикального положения сканера или поля.",
        "Важно учесть, что при изменении положения сканера также меняется расстояние до поля, поэтому рекомендуется передвинуть его для сохранения ранее настроенного расстояния.",
        "Установите калибровочное поле напротив сканера так, чтобы проецируемый крест попадал на центральную метку и совпадал с разметкой по краям. Если расстояние будет больше или меньше рабочего, вертикальная линия не будет совпадать с разметкой. Допустимая погрешность разметки равна около четверти расстояния между метками.",
        "Движение сканера",
        "Черная проекция или синяя разметка не совпадают.",
        "Оптимальная настройка рабочего расстояния!",
        "Открыть диафрагму",
        "Фокус левой камеры",
        "Фокус правой камеры",
        "Откройте диафрагму и проверьте, что фокус настроен до конца.",
        "Настройка сканера завершена. Дальше разбирается непосредственно сам процесс сканирования.",
        "Откройте диафрагму объектива так, чтобы изображение было максимально ярким, но без пересвета. Если изображение размытое, сфокусируйте объективы.",
        "На данном шаге необходимо настроить фокус объективов. Откройте диафрагму камер и сфокусируйте объективы, чтобы изображение не было размытым.",
        "Диафрагма - это непрозрачная перегородка, ограничивающая поперечное сечение световых пучков. Она имеет круглое отверстие переменного диаметра, центр которого совпадает с оптической осью, что позволяет управлять пропусканием света и глубиной резкости.",
        "Если требуется отсканировать темный объект, диафрагму можно открыть больше рекомендованного значения, чтобы экспозиция стала выше. Оптимальное закрытие диафрагмы составляет 70-80%.",
        "На этом этапе происходит сбор данных об объекте с помощью 3D-сканера. Чтобы получить точный результат, важно правильно подготовить объект и убедиться, что он полностью охвачен сканированием.",
        "Если объект имеет сложную форму и его необходимо отсканировать при помощи ручного сканера, нужно расставить метки по периметру.",
        "Если объект черный, блестящий или прозрачный, то для сканирования его потребуется покрасить матовой белой краской.",
        "Покрасьте шестерню в матовый белый цвет при помощи спрея.",
        "Объект успешно окрашен и готов к сканированию.",
        "При сканировании объектов сшитие изображений для 3D модели происходит по ближайшим точкам на снимке. Соответственно, для правильного сшития необходимо, чтобы при повороте объекта была видима некоторая часть с предыдущего снимка.",
        "Поворот объекта может осуществляться как вручную, так и на поворотном столе. Для упрощения и автоматизации задачи используем поворотный стол.",
        "Для полного сканирования объекта также будет необходимо отсканировать его в разных плоскостях.",
        "Процесс сканирования не завершен",
        "Процесс сканирования завершен успешно",
        "Выставьте рекомендуемые значения и начните сканирование.",
        "Параметры поворотного стола",
        "Сканов за оборот",
        "Начать сканирование",
        "Задержка перед сканом",
        "Выставлены не все значения",
        "Параметры сканирования",
        "Выдержка",
        "Подсвет проектора",
        "Крест",
        "Чем больше значение, тем больше будет снимков, что повлечет за собой увелечиние времени сканирования, но увеличенную точность. Рекомендуемое значение = 12.",
        "Миллисекунды задержки после остановки поля для снимка. Рекомендуемое значение = 500.",
        "Выдержка камер для сканирования. Более низкое значение позволяет уменьшить пересветы, а более высокое может помочь при сканировании темных объектов. Рекомендуется выставлять такое же значение, как во время калибровки (50).",
        "Подсветка проектора во время сканирования. Обычно доступны режимы: крест, черный, белый и полосы.",
        "Ускорить время",
        "Продолжить сканирование",
        "Объект был просканирован во всех нужных плоскостях. Нет необходимости продолжать сканирование.",
        "Переверните объект, чтобы продолжить сканирование.",
        "После завершения сканирования будет доступен предпросмотр модели в 3D и возможность экспортировать или сразу обработать её. Рассмотрим процесс экспорта.",
        "Предпросмотр",
        "Скан",
        "Группа",
        "Выделите все группы, постройте модель и экспортируйте ее",
        "Построить модель",
        "Экспортировать",
        "Сначала необходимо выделить все группы сканов.",
        "Снимите выделение с группы сканов и оставьте только модель.",
        "Качество модели",
        "Высокое",
        "Качество влияет на итоговое количество полигонов (деталей) модели",
        "Модель была успешно построена и сохранена.",
        "Модель",
        "После сканирования итоговая модель может быть не всегда удачной в связи с некоторыми дефектами. Эти данные рекомендуется обработать, чтобы получить хороший результат 3D модели. Этап включает такие шаги, как удаление шума, заполнение пробелов и сшитие.",
        "Рассмотрим дефектный скан с шумом. Зачастую шум можно удалить при помощи автоматических методов, но если его слишком много, то необходимо обработать модель вручную.",
        "Шум - случайная составляющая общей ошибки измерения. Зависит от качества поверхности объекта, внешнего освещения, положения камер, направления сканирования и т.д.",
        "Шум возник на поверхности поворотного стола из-за его небольших дефектов. Выделите шум по краям и удалите его.",
        "Очистить выделенный шум",
        "Шум не полностью удален.",
        "Шум удален полностью.",
        "Шум не выделен до конца.",
        "В результате сканирования на объекте могут образовываться дыры. Они являются результатом не идеального механизма сшития сканов. Также для обработки дыр можно использовать автоматический или ручной метод.",
        "Выделите образовавшиеся дыры и заполните их.",
        "Заполнить дыры",
        "Необходимо пометить все участки дыры.",
        "Не все участки заполнены.",
        "Все участки были успешно заполнены.",
        "Если во время сканирования группы сканов имеют мало схожих точек, то модель может быть сгенерирована некоректно. В этом случае потребуется сшить разные сканы вручную.",
        "Для сшития используйте несколько контрольных точек на разных поверхностях. Каждая точка на первом скане должна быть видима и на втором.",
        "Сшить сканы",
        "Недостаточно помеченных точек",
        "Необходимо сшить сканы",
        "Поздравляем, вы прошли и узнали все процессы 3D сканирования!"
    ],
    "achievementsData": [
        "Предметы",
        "Изучите информацию о предметах для сканирования",
        "Размеры\r",
        "Узнайте о влиянии зон различного размера на сканирование\r",
        "Регулировка сканера\r",
        "Отрегулируйте сканер на правильном расстоянии от поля\r",
        "Не в ту сторону",
        "Переверните изображения с камер в неправильную сторону\r",
        "Фокусировка\r",
        "Выставьте фокус проектора максимально четко\r",
        "Перепроверка расстояния\r",
        "Отрегулируйте сканер и сохраните рабочее расстояние\r",
        "Размытое изображение\r",
        "Выставьте фокус камер в крайние значения\r",
        "Окраска объекта\r",
        "Покрасьте объект в белый цвет при помощи спрея\r",
        "Завершение сканирования\r",
        "Отсканируйте объект во всех положениях\r",
        "Завершенная модель\r",
        "Постройте и посмотрите на итоговую модель\r",
        "Без шума\r",
        "Очистите весь шум с модели\r",
        "Без отверстий\r",
        "Заполните все дыры в модели\r",
        "Конец\r",
        "Пройдите все этапы сканирования\r"
    ],
    "averageCharacterReadingPerMinute": 1200.0
}